# Data cleaning

Data cleaning is a crucial step in the data analysis process, which involves identifying and correcting errors, inconsistencies, and discrepancies in the data. The main steps involved in data cleaning are as follows:

- **Identify missing values**: The first step in data cleaning is to identify any missing values in the data. Missing values can arise due to a variety of reasons, such as incomplete data collection, errors in data entry, or data corruption. Identifying and handling missing values is important as they can affect the results of the analysis.

- **Remove duplicates**: Duplicate data points can occur due to errors in data collection or data entry. Duplicate data can distort the analysis and lead to incorrect results. Identifying and removing duplicates is an important step in data cleaning.

- **Correct inconsistent data**: Inconsistent data can arise due to errors in data entry, data corruption, or data integration from multiple sources. Inconsistent data can include spelling errors, numerical errors, or discrepancies in the format of data. Correcting inconsistent data involves identifying the errors and making the necessary corrections.

- **Standardize data**: Standardizing data involves converting data into a consistent format. For example, converting all dates into a standard format or converting all text to lowercase. Standardizing data is important for analysis as it allows for easier comparison and analysis.

- **Handle outliers**: Outliers are data points that are significantly different from the other data points. Outliers can arise due to errors in data collection, data corruption, or genuine differences in the data. Handling outliers involves identifying the outliers and deciding how to handle them. Outliers can be removed or treated differently in the analysis.

- **Validate data**: Validating data involves checking the data for accuracy and consistency. This involves checking the data against known values or sources of information to ensure that it is accurate and consistent.

Overall, data cleaning is an iterative process that involves identifying and correcting errors in the data until the data is clean and ready for analysis.

### Titanic

The Titanic dataset is a famous dataset used in the field of data science and machine learning. It contains information about the passengers who were aboard the RMS Titanic when it sank on its maiden voyage in April 1912. The dataset is often used as an introductory dataset for learning data analysis and machine learning algorithms.

The Titanic dataset contains the following information for each passenger:

- PassengerId: A unique identifier for each passenger
- Survived: A binary variable indicating whether the passenger survived (1) or not (0)
- Pclass: The passenger's class (1st, 2nd, or 3rd)
- Name: The passenger's name
- Sex: The passenger's gender
- Age: The passenger's age
- SibSp: The number of siblings or spouses the passenger had aboard the Titanic
- Parch: The number of parents or children the passenger had aboard the Titanic
- Ticket: The passenger's ticket number
- Fare: The fare paid by the passenger
- Cabin: The passenger's cabin number
- Embarked: The port where the passenger embarked (C = Cherbourg, Q = Queenstown, S = Southampton)

The original dataset contains a total of 891 rows (here 894 rows), corresponding to the number of passengers in the dataset. The Survived column is the target variable, and the other columns are used as features for predicting whether a passenger survived or not. The dataset is often used to build predictive models to determine which passengers were more likely to survive the sinking of the Titanic based on their characteristics.

In [14]:
import pandas as pd

titanic = pd.read_csv('data/titanic_with_dub.csv')
titanic.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

#### Missing values

Dealing with missing values: The Titanic dataset has missing values in the Age, Cabin, and Embarked columns. One approach to handling missing values is to impute the missing values with mean or median values. Alternatively, rows with missing values can be dropped from the dataset.

Imputation of missing values can potentially cause a lot of bias, and you should be careful thinking about the underlying reasons for data being missing and the potential bias caused by imputation.

You can read more in this reference: [García, S., Luengo, J., & Herrera, F. (2015). Data preprocessing in data mining.](https://d1wqtxts1xzle7.cloudfront.net/60477900/Garcia__Luengo__Herrera-Data_Preprocessing_in_Data_Mining_-_Springer_International_Publishing_201520190903-77973-th1o73-libre.pdf?1567544443=&response-content-disposition=inline%3B+filename%3DIntelligent_Systems_Reference_Library_72.pdf&Expires=1679794027&Signature=Tbl8YhiUQworlYTbuS6GmJdj94mgY2vfpY86Tk7cVQEgk4qXV9~bjXxEjJWZgYxGEp724F2KkJU-WM9euX46J0d-6OlQBekLA8o7GcJ0SUNoXrE2gNzbr5SExsKeMqAYfBtmZVzlwkWTgL7WCha7lXhtPJmnmTMYl0wRiV1QA4MuAZUN-lliWU9SKdut48~KCDXRQ-sybHdakWoEL7Q1nq4JTXxreu~eMs996UJqylo0dftBtab6AGENHCw3FKUSi6CnekNrOV6fGISRIS1vcZaZdeZlfr5ywHjaQIGvobWS0--k6KtS9wVvl-28RZKbzrp2AbAqw2slXmrE-ADjbA__&Key-Pair-Id=APKAJLOHF5GGSLRBV4ZA)

In [2]:
x = titanic.iloc[[40,358,789]]
titanicdub = pd.concat([titanic, x])
titanicdub.info()
titanicdub.to_csv('data/titanic_with_dub.csv', index=False)

<class 'pandas.core.frame.DataFrame'>
Index: 897 entries, 0 to 789
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  897 non-null    int64
 1   Survived     897 non-null    int64
 2   Pclass       897 non-null    int64
 3   Name         897 non-null    object
 4   Sex          897 non-null    object
 5   Age          718 non-null    float64
 6   SibSp        897 non-null    int64
 7   Parch        897 non-null    int64
 8   Ticket       897 non-null    object
 9   Fare         897 non-null    float64
 10  Cabin        206 non-null    object
 11  Embarked     895 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 91.1+ KB

In [3]:
titanic.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 894 entries, 0 to 893
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  894 non-null    int64
 1   Survived     894 non-null    int64
 2   Pclass       894 non-null    int64
 3   Name         894 non-null    object
 4   Sex          894 non-null    object
 5   Age          716 non-null    float64
 6   SibSp        894 non-null    int64
 7   Parch        894 non-null    int64
 8   Ticket       894 non-null    object
 9   Fare         894 non-null    float64
 10  Cabin        205 non-null    object
 11  Embarked     892 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.9+ KB

In [4]:
titanic.isna().any()

PassengerId    False
Survived       False
Pclass         False
Name           False
Sex            False
Age             True
SibSp          False
Parch          False
Ticket         False
Fare           False
Cabin           True
Embarked        True
dtype: bool

In [5]:
titanic[titanic.Embarked.isna()]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
61,62,1,1,"Icard, Miss. Amelie",female,38.0,0,0,113572,80.0,B28,NaN
829,830,1,1,"Stone, Mrs. George Nelson (Martha Evelyn)",female,62.0,0,0,113572,80.0,B28,NaN

In [6]:
titanic[titanic.Cabin.isna()]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
5,6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q
7,8,0,3,"Palsson, Master. Gosta Leonard",male,2.0,3,1,349909,21.0750,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q
891,41,0,3,"Ahlin, Mrs. Johan (Johanna Persdotter Larsson)",female,40.0,1,0,7546,9.4750,NaN,S
892,359,1,3,"McGovern, Miss. Mary",female,NaN,0,0,330931,7.8792,NaN,Q

In [7]:
pd.crosstab(titanic.Pclass, titanic.Cabin.isna())

Cabin   False  True
Pclass
1         177     40
2          16    168
3          12    481

In [8]:
titanic[titanic.Age.isna()]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
5,6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q
17,18,1,2,"Williams, Mr. Charles Eugene",male,NaN,0,0,244373,13.0000,NaN,S
19,20,1,3,"Masselmani, Mrs. Fatima",female,NaN,0,0,2649,7.2250,NaN,C
26,27,0,3,"Emir, Mr. Farred Chehab",male,NaN,0,0,2631,7.2250,NaN,C
28,29,1,3,"O'Dwyer, Miss. Ellen ""Nellie""",female,NaN,0,0,330959,7.8792,NaN,Q
...,...,...,...,...,...,...,...,...,...,...,...,...
863,864,0,3,"Sage, Miss. Dorothy Edith ""Dolly""",female,NaN,8,2,CA. 2343,69.5500,NaN,S
868,869,0,3,"van Melkebeke, Mr. Philemon",male,NaN,0,0,345777,9.5000,NaN,S
878,879,0,3,"Laleff, Mr. Kristo",male,NaN,0,0,349217,7.8958,NaN,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
892,359,1,3,"McGovern, Miss. Mary",female,NaN,0,0,330931,7.8792,NaN,Q

In [9]:
titanic.groupby('Pclass').Age.describe()

        count       mean        std   min   25%   50%   75%   max
Pclass
1       187.0  38.274973  14.773930  0.92  27.0  37.0  49.0  80.0
2       173.0  29.877630  14.001077  0.67  23.0  29.0  36.0  70.0
3       356.0  25.182360  12.502615  0.42  18.0  24.0  32.0  74.0

In [10]:
import matplotlib.pyplot as plt
plt.scatter(titanic['Fare'], titanic['Age'], c=titanic['Pclass'])

ModuleNotFoundError: No module named 'matplotlib'

We will impute missing Age using linear regression.

remember to add sklearn to your environment `poetry add  scikit-learn`

In [ ]:
from sklearn.linear_model import LinearRegression
lr = LinearRegression()
columns = ['Pclass']
titanic.head()

testdf = titanic.loc[titanic['Age'].isnull()]
traindf = titanic.loc[titanic['Age'].isnull()==False]

lr.fit(traindf[columns],traindf['Age'])

pred = lr.predict(testdf[columns])
testdf['Age']= pred

In [ ]:
titanic = pd.concat([testdf, traindf], ignore_index=True)

In [ ]:
titanic.info()

#### Removing dublicates
Dealing with duplicates: Check for duplicates in the dataset, which can arise due to data entry errors or data collection methods. Duplicates can be dropped or the data can be aggregated to remove duplicate values.

There are no duplicates in the titanic data.

In [ ]:
titanic[titanic.duplicated()]

In [ ]:
#Drop duplicate rows
titanic.drop_duplicates(inplace=True)

#### Correct inconsistent data

In [13]:
titanic.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 894 entries, 0 to 893
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  894 non-null    int64
 1   Survived     894 non-null    int64
 2   Pclass       894 non-null    int64
 3   Name         894 non-null    object
 4   Sex          894 non-null    bool
 5   Age          716 non-null    float64
 6   SibSp        894 non-null    int64
 7   Parch        894 non-null    int64
 8   Ticket       894 non-null    object
 9   Fare         894 non-null    float64
 10  Cabin        205 non-null    object
 11  Embarked     892 non-null    object
dtypes: bool(1), float64(2), int64(5), object(4)
memory usage: 77.8+ KB

In [15]:
titanic.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [16]:
# Convert Sex column to binary variable
titanic["Sex"] = pd.get_dummies(titanic["Sex"]).male

In [17]:
titanic.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",True,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",False,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",False,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",False,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",True,35.0,0,0,373450,8.0500,NaN,S

In [18]:
titanic.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,897.000000,897.000000,897.000000,718.000000,897.000000,897.000000,897.000000
mean,445.670011,0.383501,2.308807,29.773217,0.521739,0.379041,32.204078
std,257.748996,0.486510,0.836834,14.521486,1.099831,0.803956,49.601455
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.000000,0.000000,2.000000,20.625000,0.000000,0.000000,7.895800
50%,445.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,669.000000,1.000000,3.000000,39.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

#### Handle outliers

In [ ]:
import matplotlib.pyplot as plt # pip install matplotlib

# Create boxplots to visualize outliers in numerical variables
fig, axs = plt.subplots(1, 2, figsize=(10,5))
axs[0].boxplot(titanic["Age"])
axs[0].set_title("Boxplot of Age")
axs[1].boxplot(titanic["Fare"])
axs[1].set_title("Boxplot of Fare")
plt.show()

*A boxplot from the Matplotlib library shows the median value as a horizontal line inside a box that represents the interquartile range (IQR), with the lower and upper whiskers indicating the lowest and highest non-outlier values within 1.5 times the IQR of the lower and upper quartile, respectively. Outliers are displayed as individual points outside the whiskers.*

In [ ]:
# Calculate z-scores to identify outliers in numerical variables
from scipy import stats
z_scores_age = stats.zscore(titanic["Age"])
z_scores_fare = stats.zscore(titanic["Fare"])
threshold = 3
outliers_age = titanic["Age"][abs(z_scores_age) > threshold]
outliers_fare = titanic["Fare"][abs(z_scores_fare) > threshold]
print("Outliers in Age:", outliers_age)
print("Outliers in Fare:", outliers_fare)

#### Standardize data

In [ ]:
# Scale numerical variables
from sklearn.preprocessing import StandardScaler, MaxAbsScaler
scaler = MaxAbsScaler()
titanic[["Age", "Fare"]] = scaler.fit_transform(titanic[["Age", "Fare"]])

return to [overview](../00_overview.ipynb)